Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/cancer_services/breastcheck.html.txt.tmx
Source language: en
Languages: ga

source: BreastCheck is the national breast screening programme
ga: Is é BreastCheck an clár náisiúnta scagthástála cíoch

source: The aim of the programme is the early detection and treatment of breast cancer in women who show no symptoms of the disease
ga: Is í aidhm an chláir chun ailse chíche a bhrath agus a chóireáil go luath i measc ban nach bhfuil aon chomharthaí i leith an ghalair acu

source: Breast cancer screening under the BreastCheck programme is available free of charge to women who are aged 50–64
ga: Tá fáil ag mná ar scagthástáil ailse chíche faoi chlár BreastCheck saor in aisce atá idir 50 agus 64 bliain d’aois

source: It is being extended so that by the end of 2021 all eligible women aged 50–69 will be invited for routine screening
ga: Fógraíodh i mBuiséad 2015 go sínfear é do mhná idir 65 agus 69 bliain d’aois. Cuirfear tús le scagthástáil an ghrúpa seo go déanach in 2015

source: If you are in the age range 50–64 and you have not yet been offered an appointment, you may contact BreastCheck directly
ga: Má tá tú sa sprioc-aoisghrúpa agus murar cuireadh coinne ar tairiscint duit go fóill, féadfaidh tú teagmháil a dhéanamh le BreastCheck go díreach

source: BreastCheck is designed to offer repeat screening within an interval of 21–27 months
ga: Tá BreastCheck in ainm is scagthástáil leantach a chur ar fáil laistigh d’eatramh 21-27 mí

source: If you are outside of the target age group and avail of breast screening in a private hospital, you will have to pay for the service
ga: Má tá tú lasmuigh den sprioc-aoisghrúpa agus má dhéantar scagthástáil chíche ort in ospidéal príobháideach, beidh ort íoc as an tseirbhís

source: If you have any concerns regarding breast cancer, have a family history of breast cancer or symptoms you are worried about, you should contact your GP who will, if appropriate, refer you to the symptomatic breast services in your area
ga: Má tá aon bhuarthaí ort maidir le hailse chíche, má tá stair d’ailse chíche i do mhuintir nó má tá comharthaí d’ailse chíche agat a bhfuil tú buartha fúthu, ba cheart duit teagmháil a dhéanamh le do LG a atreoróidh thú, más cuí, chuig na seirbhísí siomptómacha cíche atá suite i do cheantar áitiúil

source: BreastCheck compiles a register of women eligible for screening from information supplied by the Department of Social Protection, General Medical Services and private health insurance providers
ga: Cuireann BreastCheck clár ban i dtoll a chéile atá i dteideal scagthástáil a fháil ó fhaisnéis a sholáthraíonn an Roinn Coimirce Sóisialaí, Seirbhísí Ginearálta Míochaine agus soláthróirí árachas príobháideach sláinte

source: You can check if you are on the BreastCheck register
ga: Féadfaidh tú seiceáil an bhfuil tú ar chlár BreastCheck

source: If, having searched the database, you are on not on the register, you will then have an option to register
ga: Mura bhfuil tú ar an gclár, tar éis an bunachar sonraí a chuardach, beidh an rogha agat chun clárú a dhéanamh

source: You can contact BreastCheck by telephoning 1800 45 45 55 for further information. Where to apply BreastCheck King's Inns House 200 Parnell Street Dublin 1 Ireland Tel:(01) 865 9300 Locall:1800 45 45 55 Fax:(01) 865 9333 Homepage: http://www.breastcheck.ie Email: info@breastcheck.ie Irish Cancer Society 43-45 Northumberland Road Dublin 4 Ireland Tel:(01) 2310 500 Locall:Freephone Helpline 1800 200 700 Fax:(01) 2310 555 Homepage: http://www.cancer.ie/ Email: cancernurseline@irishcancer.ie Marie Keating Foundation Unit 9 Millbank Business Park Dublin Ireland Tel:+353 (0)1 6283726 Fax:+353 (0)1 6247916 Homepage: http://www.mariekeating.ie Email: info@mariekeating.ie The Marie Keating Foundation is a charitable organisation set up to raise awareness about breast and other cancers. The foundation has three mobile units that travel throughout Ireland staffed by trained nurses, providing free information and advice on cancer issues
ga: Féadfaidh tú teagmháil a dhéanamh le BreastCheck trí ghlao ar 1800 45 45 55 chun breis faisnéise a fháil
